USE ГАИ2
GO
INSERT INTO Роль VALUES
  ('user')
  ,('admin')
INSERT INTO Автомобиль VALUES
  ('JN1HS34P113487234','Nissan','Almera','Красный')
  ,('VG3HS34P1KW012341','Renault','Logan','Черный')
  ,('STPHS34P1KH727349','Toyota','Corolla','Темно-синий')
GO
INSERT INTO Водитель VALUES
  ('Иванов','Сергей','Анатольевич','HB3008972','80291391385')
  ,('Попов','Никита','Антонович','HB5374738','80447185162')
  ,('Симонов','Аркадий','Сергеевич','HB4121384','80447118833')
  ,('Петрушкин','Алексей','Федорович','HB1267356','80447152361')
GO
INSERT INTO Звание VALUES
  ('Младший лейтенант')
  ,('Старшина')
  ,('Старший сержант')
GO
INSERT INTO Категория VALUES
  ('A','мотоциклы')
  ,('B','автомобиль и грузовые до 3.5 тонн')
  ,('D','автобусы')
GO
INSERT INTO [Тип нарушения] VALUES
  ('Превышение скорости')
  ,('Нарушение правил маневрирования')
  ,('Открытие дверей во время движения')
GO
INSERT INTO [Водительское удостоверение] VALUES
  ('3896561','20090802','20190802',1)
  ,('3897123','20090803','20190803',2)
  ,('5431041','20190811','20290811',1)
  ,('5445656','20190811','20290811',2)
  ,('5646534','20190813','20290813',3)
GO
INSERT INTO [Категории удостоверения] VALUES
  (1,1)
  ,(2,1)
  ,(2,2)
  ,(1,3)
  ,(2,3)
  ,(2,4)
  ,(2,5)
GO
INSERT INTO Сотрудник VALUES
  ('avsumonchik','vLFfghR5tNV3K9DKhmwArV+SbjWAcgZZzIDTnJ0JgCo=','Сумончик','Андрей','Валерьевич','80445653274',1,2)
  ,('vasolovyev','TMj01gm3FzVnAcV6A+c35ayP6IXajHFj095H4BhJxjU=','Соловьев','Виктор','Александрович','80296548783',2,1)
  ,('eeveremeychik','aEh9wpUFKqecUw4oPOaYuMa7G0L/CUQlLhkQ2+zcVCU=','Веремейчик','Евгений','Евгеньевич','80293193487',2,1)
  ,('lvyakovtseva','aff3p/i8qZcPpvnAuNrQaQHT7yP9WZ0yE6pe7lYhw+M=','Яковцева','Людмила','Васильевна','80335674428',3,1)
  ,('vsanafiev','r0HmjhMJ+imlBEy9w2uQo4IdiAfmjHZ1psSVESvIpV8=','Анафьев','Виктор','Сергеевич','80291917643',1,1)
GO
INSERT INTO Регистрация VALUES
  ('2819KX-3','20221219',1,1,1)
  ,('1566KK-3','20221220',1,2,3)
  ,('6593KB-3','20221221',2,2,5)
  ,('2417II-3','20220504',3,3,4)
  ,('6767KI-3','20230909',1,3,1)
  ,('1212KK-3','20231010',3,2,3)
  ,('5643KB-3','20231212',2,3,4)
GO
INSERT INTO Нарушение VALUES
  ('20230501','13941234',300,0,1,1,1)
  ,('20230502','14012541',400,0,1,3,3)
  ,('20230503','14056341',1000,6,2,2,1)
  ,('20230504','14115611',300,0,2,2,2)
  ,('20230505','14123437',400,0,3,3,3)
  ,('20230506','14354658',1000,6,3,3,1)
  ,('20230507','14019231',800,0,3,3,3)
GO